### CCR Terraform Plan
```
wiz_cloud_configuration_rule.aws_root_account_usage: Refreshing state... [id=92a804ca-e1f4-4a00-8d43-8dce87c15124]
wiz_cloud_configuration_rule.aws_rds_snapshot_untrusted_sharing: Refreshing state... [id=71274072-f8ea-4687-8e96-c28ca9b7b667]
wiz_cloud_configuration_rule.aws_kms_key_rotation_warning: Refreshing state... [id=14574b26-ac5b-49d4-803b-2e0ab602e24e]
wiz_cloud_configuration_rule.aws_support_saml_role_missing_type_tag: Refreshing state... [id=f6f9e6d4-3bad-407f-a18b-a49897767252]
wiz_cloud_configuration_rule.aws_untagged_access_key_older_than_25_days: Refreshing state... [id=e930596a-a56d-462d-a67a-07fe5133fcbc]
wiz_cloud_configuration_rule.aws_user_access_key_older_than_30_days: Refreshing state... [id=ad5884e6-b52e-4fae-a715-2fe85e891f24]
wiz_cloud_configuration_rule.aws_root_access_key: Refreshing state... [id=bb27c899-ee59-4903-90fe-e8d0ebca537c]
wiz_cloud_configuration_rule.aws_administrator_role_missing_type_tag: Refreshing state... [id=84426a54-3552-4a91-8a8d-b369a0d88ac7]
wiz_cloud_configuration_rule.aws_snapshot_untrusted_sharing: Refreshing state... [id=08dce817-39d9-47b5-b757-146979e081ad]
wiz_custom_rego_package.jtb75_globals: Refreshing state... [id=09d212b2-eae1-4acd-80de-2a62ba97e54a]
wiz_cloud_configuration_rule.aws_service_linked_role_missing_type_tag: Refreshing state... [id=33ed40f8-2619-4bdc-a0c0-bce8eb2a952f]
wiz_cloud_configuration_rule.aws_service_role_missing_type_tag: Refreshing state... [id=2dc460ac-315f-4a71-9680-7ab3175defbe]
wiz_cloud_configuration_rule.aws_vendor_access_key_older_than_60_days: Refreshing state... [id=9610a337-bd09-4be0-885d-c207845c346c]
wiz_cloud_configuration_rule.aws_role_untrusted_trust: Refreshing state... [id=9de30a30-4aed-4527-9b1e-74ae7df79322]
wiz_cloud_configuration_rule.aws_service_access_key_older_than_85_days: Refreshing state... [id=99cdcbd6-8f92-4563-b8ba-6577952a885d]
wiz_cloud_configuration_rule.aws_root_missing_mfa: Refreshing state... [id=0413c23b-d8f6-46c3-a23d-a814c02986fd]
wiz_cloud_configuration_rule.aws_deploy_role_missing_type_tag: Refreshing state... [id=4b47595b-f005-4fc6-921c-f4a1c5f49d66]
wiz_cloud_configuration_rule.aws_untagged_access_key_older_than_30_days: Refreshing state... [id=8561d154-6988-4f9e-9dfa-d66acd56a4c2]
wiz_cloud_configuration_rule.aws_kms_key_expiration: Refreshing state... [id=e4885747-3a5c-4008-9bcb-a005819025ac]
wiz_cloud_configuration_rule.aws_missing_type_tag: Refreshing state... [id=05106dc9-65f8-4689-a5ea-d93abb58d94a]
wiz_cloud_configuration_rule.aws_s3_bucket_untrusted_sharing: Refreshing state... [id=b0661f1e-f680-4f84-a341-263b595aaa51]
wiz_cloud_configuration_rule.aws_vendor_access_key_older_than_55_days: Refreshing state... [id=98ef907b-5fb9-4a1e-9b11-71c4cb833b3a]
wiz_cloud_configuration_rule.aws_consumer_role_missing_type_tag: Refreshing state... [id=805d13fb-5c22-4ce0-b413-c1318e7fee4a]
wiz_file_upload.remove_untrusted_trust: Refreshing state... [id=3628231]
wiz_cloud_configuration_rule.aws_service_access_key_older_than_90_days: Refreshing state... [id=ef3818ae-8e87-4de5-972b-704812e075a0]
wiz_cloud_configuration_rule.aws_vendor_role_auto_tag: Refreshing state... [id=565a1e30-5afe-43f5-b3cd-3576f6fed4de]
wiz_cloud_configuration_rule.aws_user_aws_managed_policy: Refreshing state... [id=e9ed41b2-90c7-4f52-bdf9-841521bc7c15]
wiz_cloud_configuration_rule.aws_user_access_key_older_than_25_days: Refreshing state... [id=67d265b8-4dd9-41dc-8d1a-0b6f0eb9c9c0]
wiz_file_upload.tag_consumer_role: Refreshing state... [id=3628230]
wiz_cloud_configuration_rule.aws_ami_untrusted_sharing: Refreshing state... [id=61a5d196-8ce0-40dc-ac8b-068fe7f98fdf]
wiz_cloud_configuration_rule.aws_support_role_missing_type_tag: Refreshing state... [id=b8e3ad9b-d9f3-4c07-b598-ab8766d80c4c]
wiz_cloud_configuration_rule.aws_apigateway_no_authorization: Refreshing state... [id=a5d1ba53-3446-4849-9cf8-3d7e7141ec47]
wiz_cloud_configuration_rule.aws_s3_classified_bucket_encryption: Refreshing state... [id=ffb578d2-07f8-40b9-a944-78f59bb643d5]
wiz_cloud_configuration_rule.aws_rds_backup_retention: Refreshing state... [id=74eb2a75-ea27-4f5b-a82a-1507b81df4b8]
wiz_cloud_configuration_rule.aws_vendor_role_missing_type_tag: Refreshing state... [id=a314df4d-9e9f-4a7a-9604-ca7355c56b8f]
wiz_response_action_catalog_item.remove_untrusted_trust: Refreshing state... [id=7f944527-0d04-4df5-a007-495234ebd355]
wiz_response_action_catalog_item.tag_consumer_role: Refreshing state... [id=561aa57b-b8a2-43df-b18e-b2d14e0377ce]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # wiz_file_upload.deactivate_stale_access_keys will be created
  + resource "wiz_file_upload" "deactivate_stale_access_keys" {
      + content      = <<-EOT
            """
            Deactivate IAM access keys that have exceeded their rotation threshold.
            
            Pairs with CCRs:
            - JTB75 - Service account access keys should be rotated every 90 days
            - JTB75 - User access keys should be rotated every 30 days
            - JTB75 - Vendor access keys should be rotated every 60 days
            - JTB75 - Untagged access keys should be rotated every 30 days
            
            Checks each active access key's age and deactivates keys that exceed the
            threshold for the user's type tag (service=90d, vendor=60d, user/default=30d).
            
            Deactivated key IDs are saved as a tag (wiz:deactivated-keys) on the IAM
            user, enabling the revert function to re-activate them.
            
            IAM Permissions required (remediate):
            - iam:ListAccessKeys
            - iam:GetAccessKeyLastUsed
            - iam:UpdateAccessKey
            - iam:ListUserTags
            - iam:TagUser
            
            IAM Permissions required (revert):
            - iam:UpdateAccessKey
            - iam:ListUserTags
            - iam:UntagUser
            """
            
            from datetime import datetime, timezone
            
            import boto3
            from botocore.exceptions import ClientError
            
            from wiz.context import AwsRemediationContext
            from wiz.models import TargetRemediationArgs
            from wiz.logger import logger
            from wiz.safe_remediate import remediate_and_log_error
            
            # Rotation thresholds in days by user type tag
            THRESHOLDS = {
                "service": 90,
                "vendor": 60,
                "user": 30,
            }
            DEFAULT_THRESHOLD = 30
            
            BACKUP_TAG_KEY = "wiz:deactivated-keys"
            
            
            def _get_user_type(iam, user_name):
                """Get the type tag value for an IAM user."""
                try:
                    response = iam.list_user_tags(UserName=user_name)
                    for tag in response.get("Tags", []):
                        if tag["Key"] == "type":
                            return tag["Value"]
                except ClientError:
                    pass
                return None
            
            
            def remediate(context: AwsRemediationContext):
                remediation_args: TargetRemediationArgs = context.get_remediation_args()
            
                user_name = remediation_args.name
                region = remediation_args.region
            
                logger.info("Starting stale access key deactivation", user=user_name, region=region)
            
                session: boto3.Session = context.get_session()
                iam = session.client("iam", region_name=region)
            
                # Determine threshold based on user type
                user_type = _get_user_type(iam, user_name)
                threshold_days = THRESHOLDS.get(user_type, DEFAULT_THRESHOLD)
                logger.info("Using threshold", user=user_name, type=user_type, threshold_days=threshold_days)
            
                # List access keys
                try:
                    response = iam.list_access_keys(UserName=user_name)
                except ClientError as e:
                    error_msg = e.response["Error"]["Message"]
                    logger.error("Failed to list access keys", user=user_name, error=error_msg)
                    raise Exception(error_msg)
            
                now = datetime.now(timezone.utc)
                deactivated = []
            
                for key_meta in response["AccessKeyMetadata"]:
                    key_id = key_meta["AccessKeyId"]
                    status = key_meta["Status"]
                    create_date = key_meta["CreateDate"]
            
                    if status != "Active":
                        continue
            
                    age_days = (now - create_date).days
                    if age_days <= threshold_days:
                        continue
            
                    logger.info(
                        "Deactivating stale key",
                        user=user_name,
                        key_id=key_id,
                        age_days=age_days,
                        threshold_days=threshold_days,
                    )
            
                    try:
                        iam.update_access_key(
                            UserName=user_name,
                            AccessKeyId=key_id,
                            Status="Inactive",
                        )
                        deactivated.append(key_id)
                    except ClientError as e:
                        error_msg = e.response["Error"]["Message"]
                        logger.error("Failed to deactivate key", user=user_name, key_id=key_id, error=error_msg)
                        raise Exception(error_msg)
            
                if not deactivated:
                    raise Exception(
                        f"User {user_name} has no active keys exceeding {threshold_days} days. "
                        "A scan may not have run yet to close the finding."
                    )
            
                # Save deactivated key IDs as a tag for revert
                deactivated_value = ",".join(deactivated)
                try:
                    iam.tag_user(
                        UserName=user_name,
                        Tags=[{"Key": BACKUP_TAG_KEY, "Value": deactivated_value}],
                    )
                    logger.info("Saved deactivated keys to tag", user=user_name, keys=deactivated_value)
                except ClientError as e:
                    logger.warning(
                        "Failed to save backup tag",
                        user=user_name,
                        error=e.response["Error"]["Message"],
                    )
            
                logger.info(
                    "Successfully deactivated stale access keys",
                    user=user_name,
                    deactivated=deactivated,
                )
            
            
            def revert(context: AwsRemediationContext):
                remediation_args: TargetRemediationArgs = context.get_remediation_args()
            
                user_name = remediation_args.name
                region = remediation_args.region
            
                logger.info("Starting access key reactivation", user=user_name, region=region)
            
                session: boto3.Session = context.get_session()
                iam = session.client("iam", region_name=region)
            
                # Get the backup tag
                try:
                    response = iam.list_user_tags(UserName=user_name)
                    tags = {t["Key"]: t["Value"] for t in response.get("Tags", [])}
                except ClientError as e:
                    error_msg = e.response["Error"]["Message"]
                    logger.error("Failed to get user tags", user=user_name, error=error_msg)
                    raise Exception(error_msg)
            
                deactivated_value = tags.get(BACKUP_TAG_KEY)
                if not deactivated_value:
                    raise Exception(
                        f"User {user_name} has no deactivated keys tag ({BACKUP_TAG_KEY}). "
                        "Cannot revert."
                    )
            
                key_ids = deactivated_value.split(",")
                logger.info("Re-activating keys", user=user_name, keys=key_ids)
            
                for key_id in key_ids:
                    try:
                        iam.update_access_key(
                            UserName=user_name,
                            AccessKeyId=key_id,
                            Status="Active",
                        )
                        logger.info("Re-activated key", user=user_name, key_id=key_id)
                    except ClientError as e:
                        error_msg = e.response["Error"]["Message"]
                        logger.error("Failed to re-activate key", user=user_name, key_id=key_id, error=error_msg)
                        raise Exception(error_msg)
            
                # Remove the backup tag
                try:
                    iam.untag_user(UserName=user_name, TagKeys=[BACKUP_TAG_KEY])
                except ClientError as e:
                    logger.warning(
                        "Failed to remove backup tag",
                        user=user_name,
                        error=e.response["Error"]["Message"],
                    )
            
                logger.info("Successfully reverted access key deactivation", user=user_name)
            
            
            if __name__ == "__main__":
                remediate_and_log_error(remediate)
        EOT
      + content_hash = (known after apply)
      + filename     = "deactivate-stale-access-keys.py"
      + id           = (known after apply)
      + url          = (known after apply)
    }

  # wiz_response_action_catalog_item.deactivate_stale_access_keys will be created
  + resource "wiz_response_action_catalog_item" "deactivate_stale_access_keys" {
      + cloud_platform                    = "AWS"
      + cloud_provider_permissions        = [
          + "iam:GetAccessKeyLastUsed",
          + "iam:ListAccessKeys",
          + "iam:ListUserTags",
          + "iam:TagUser",
          + "iam:UpdateAccessKey",
        ]
      + description                       = "Deactivate IAM access keys that have exceeded the rotation threshold for the user's type (service=90d, vendor=60d, user/default=30d)."
      + file_upload                       = (known after apply)
      + id                                = (known after apply)
      + name                              = "JTB75 - Deactivate stale access keys"
      + revert_cloud_provider_permissions = [
          + "iam:ListUserTags",
          + "iam:UntagUser",
          + "iam:UpdateAccessKey",
        ]
      + revertible                        = true
      + versions                          = (known after apply)

      + targets {
          + cloud_configuration_rule = [
              + "8561d154-6988-4f9e-9dfa-d66acd56a4c2",
              + "9610a337-bd09-4be0-885d-c207845c346c",
              + "ad5884e6-b52e-4fae-a715-2fe85e891f24",
              + "ef3818ae-8e87-4de5-972b-704812e075a0",
            ]
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```